projects/sideprojects/garun/garun.org

#+TITLE: garun projects
#+STARTUP: inlineimages

* Garun
** programming implementation design choise
*** what language to use?
*** which types of markdown style can I use? (org mode can't be used because gpl v3 license)
alternative:
1. [[https://github.com/200ok-ch/organice][organice]]
** features underimplementation + known error
*** uncaterogized
*** pdf related workflow
**** PROJECT when open pdf file PDFView is not a default (DocView is still in used). This is a unexpected behavior because when install pdf-tools PDFView should be automatically set as default
*** org mode
**** checkbox doesn't work for some reason, so all checkbox related commands cannot be tested.
**** figure out how to perform multi-select in dropdown (output by vertico, ivy, etc.)
**** assign schedule and deadline to header doesn't show in agenda?
**** figure out a way to manage archive contents
- requirements
  + how to make them searchable
    - ref:
      + https://www.reddit.com/r/orgmode/comments/9kunnv/archiving_practices/
      + https://fuco1.github.io/2017-04-20-Archive-subtrees-under-the-same-hierarchy-as-original-in-the-archive-files.html
- FAQs
  + best practices for archiving content?

**** create org-capture such that new added content will be appended to the end of the file.
**** implement tagging system in org roam
***** note
****** follow roam research's tagging system which use page,block,filter by page,backlink, reference link.
******* tags and categories features from org-mode can be derived by roam research tagging system
****** one thing that roam research tagging doesn't provide is when I set page as directory for example dir1/dir2/dir3. To improve roam research to include this features few things have to be considered
******* pages should be able to filter by directory.
**** syncing change on a tangled file back to original org file
:PROPERTIES:
:ID:       6ffa9220-2744-448a-ab30-5781ad44130e
:END:

ref: https://emacs.stackexchange.com/questions/12889/syncing-changes-on-a-tangled-file-back-to-the-original-org-file
ref: https://emacs.stackexchange.com/questions/12889/syncing-changes-on-a-tangled-file-back-to-the-original-org-file

tools
1. lentic server
2. [[https://github.com/mtekman/org-tanglesync.el][org-tanglesync]]
**** copy link out of org mode
ref: https://emacs.stackexchange.com/questions/3981/how-to-copy-links-out-of-org-mode
**** integrate organice to push org files to clouds where I can be access via phone and enable syncing between device.

**** presentation
***** try using =demo-it= plugins for code along styles presentation
**** PROJECT implement a command such that when inside a subtree, I can close the parent subtree in which the cursor is wihtin.
**** org roam
***** when inside of a page, I should be able to select existing heading of the selected pages to insert as a link.
The user experience here is more seamless than having to navigate to the page -> find the heading -> copy link from the heading and come back to insert.

This faetures is waiting on implementation on [[*PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)][PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)]]
***** for any heading that have a link attach to it, id should be automatically generated so that that this block now will be treated as a "node" which have a set of faetures available to it.

example of feature that can be useful are "synchonized name change" (name of the reference node change when the original node name is change.)
**** PROJECT implement tagging system. currently, I used other people default setup and it doesn't fit my needs.
**** typing ']]' will close code block that doesn't yet been close. This is behavior is similar to latex in vim that I have set up. (This enhances flexibility of use case)
**** PROJECT literate programming in emacs
ref:
- https://jamiecollinson.com/blog/my-emacs-config/
- https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org

note:
this can be used when writing report for data science project as well [[https://www.youtube.com/watch?v=dljNabciEGg&ab_channel=HowardAbrams][literate devops]].
***** allow header property =:dir:= to be set as a starting point of directory in which code will be operate on.
**** PROJECT allow cmd command (defined in .zshrc) to be used in org-babel code block
***** error
I am not sure what is going on but when I run the block with bash/zsh/sh =cmd= command is not found
*** user experience
ref:
- https://hungyi.net/posts/doom-emacs-search-replace-project/#fn.1
**** enlarge window to occupy the whole space and reset window to default (which occupied space equally)
I accidentally deleted enlarg-window-maximize, so I have to reimplement it
#+BEGIN_SRC elisp
(global-set-key (kbd "C-x !") 'enlarge-window-maximize)
#+END_SRC

**** increase/decrease text size such that all other buffer text size will be adjusted at the same time. (not limited to opened buffer; all future buffer should also obey condition)

#+BEGIN_SRC emacs-lisp
(defadvice text-scale-increase (around all-buffers (arg) activate)
  (dolist (buffer (buffer-list))
    (with-current-buffer buffer
      ad-do-it)))
#+END_SRC
**** capture Gif/video of screen using emacs command line, and automatically upload to cloud.
**** GTD
***** PROJECT seamlessly managing actions-wise tasks
****** add new actions to child/nighbour bullet point of the current subtree of actions (the structure is similar to one I use in vim TODOMANAGER)
