projects/sideprojects/public/garun.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-04 Thu 10:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>garun projects</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="DESKTOP-5MMF71L" />
<link rel="styleheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">garun projects</h1>

<div id="outline-container-org1bb9e42" class="outline-2">
<h2 id="org1bb9e42">Garun</h2>
<div class="outline-text-2" id="text-org1bb9e42">
</div>
<div id="outline-container-orgda721fd" class="outline-3">
<h3 id="orgda721fd">programming implementation design choise</h3>
<div class="outline-text-3" id="text-orgda721fd">
</div>
<div id="outline-container-org0071def" class="outline-4">
<h4 id="org0071def">what language to use?</h4>
</div>
<div id="outline-container-orgc8ab20b" class="outline-4">
<h4 id="orgc8ab20b">which types of markdown style can I use? (org mode can't be used because gpl v3 license)</h4>
<div class="outline-text-4" id="text-orgc8ab20b">
<p>
alternative:
</p>
<ol class="org-ol">
<li><a href="https://github.com/200ok-ch/organice">organice</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org80dac2d" class="outline-3">
<h3 id="org80dac2d">features underimplementation + known error</h3>
<div class="outline-text-3" id="text-org80dac2d">
</div>
<div id="outline-container-org696447a" class="outline-4">
<h4 id="org696447a">uncaterogized</h4>
</div>
<div id="outline-container-org3fc72d6" class="outline-4">
<h4 id="org3fc72d6">pdf related workflow</h4>
<div class="outline-text-4" id="text-org3fc72d6">
</div>
<ul class="org-ul">
<li><a id="org9311d3d"></a>PROJECT when open pdf file PDFView is not a default (DocView is still in used). This is a unexpected behavior because when install pdf-tools PDFView should be automatically set as default<br /></li>
</ul>
</div>
<div id="outline-container-orgdd96391" class="outline-4">
<h4 id="orgdd96391">org mode</h4>
<div class="outline-text-4" id="text-orgdd96391">
</div>
<ul class="org-ul">
<li><a id="org356f525"></a>checkbox doesn't work for some reason, so all checkbox related commands cannot be tested.<br /></li>
<li><a id="orgec25368"></a>figure out how to perform multi-select in dropdown (output by vertico, ivy, etc.)<br /></li>
<li><a id="org90f8b17"></a>assign schedule and deadline to header doesn't show in agenda?<br /></li>
<li><a id="orgf57621e"></a>figure out a way to manage archive contents<br />
<div class="outline-text-5" id="text-orgf57621e">
<ul class="org-ul">
<li>requirements
<ul class="org-ul">
<li>how to make them searchable
<ul class="org-ul">
<li>ref:
<ul class="org-ul">
<li><a href="https://www.reddit.com/r/orgmode/comments/9kunnv/archiving_practices/">https://www.reddit.com/r/orgmode/comments/9kunnv/archiving_practices/</a></li>
<li><a href="https://fuco1.github.io/2017-04-20-Archive-subtrees-under-the-same-hierarchy-as-original-in-the-archive-files.html">https://fuco1.github.io/2017-04-20-Archive-subtrees-under-the-same-hierarchy-as-original-in-the-archive-files.html</a></li>
</ul></li>
</ul></li>
</ul></li>
<li>FAQs
<ul class="org-ul">
<li>best practices for archiving content?</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orgf255fbb"></a>create org-capture such that new added content will be appended to the end of the file.<br /></li>
<li><a id="orge15bff5"></a>implement tagging system in org roam<br />
<ul class="org-ul">
<li><a id="org0c1df22"></a>note<br />
<ul class="org-ul">
<li><a id="org4799f10"></a>follow roam research's tagging system which use page,block,filter by page,backlink, reference link.<br />
<ul class="org-ul">
<li><a id="org3fec885"></a>tags and categories features from org-mode can be derived by roam research tagging system<br /></li>
</ul>
</li>
<li><a id="org577839e"></a>one thing that roam research tagging doesn't provide is when I set page as directory for example dir1/dir2/dir3. To improve roam research to include this features few things have to be considered<br />
<ul class="org-ul">
<li><a id="org9b02374"></a>pages should be able to filter by directory.<br /></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a id="orgcc4c1bd"></a>syncing change on a tangled file back to original org file<br />
<div class="outline-text-5" id="text-orgcc4c1bd">
<p>
ref: <a href="https://emacs.stackexchange.com/questions/12889/syncing-changes-on-a-tangled-file-back-to-the-original-org-file">https://emacs.stackexchange.com/questions/12889/syncing-changes-on-a-tangled-file-back-to-the-original-org-file</a>
ref: <a href="https://emacs.stackexchange.com/questions/12889/syncing-changes-on-a-tangled-file-back-to-the-original-org-file">https://emacs.stackexchange.com/questions/12889/syncing-changes-on-a-tangled-file-back-to-the-original-org-file</a>
</p>

<p>
tools
</p>
<ol class="org-ol">
<li>lentic server</li>
<li><a href="https://github.com/mtekman/org-tanglesync.el">org-tanglesync</a></li>
</ol>
</div>
</li>
<li><a id="orgab2c3eb"></a>copy link out of org mode<br />
<div class="outline-text-5" id="text-orgab2c3eb">
<p>
ref: <a href="https://emacs.stackexchange.com/questions/3981/how-to-copy-links-out-of-org-mode">https://emacs.stackexchange.com/questions/3981/how-to-copy-links-out-of-org-mode</a>
</p>
</div>
</li>
<li><a id="orgf8b2f4e"></a>integrate organice to push org files to clouds where I can be access via phone and enable syncing between device.<br /></li>

<li><a id="orgd6dd646"></a>presentation<br />
<ul class="org-ul">
<li><a id="org7bdbe36"></a>try using <code>demo-it</code> plugins for code along styles presentation<br /></li>
</ul>
</li>
<li><a id="org12684d4"></a>PROJECT implement a command such that when inside a subtree, I can close the parent subtree in which the cursor is wihtin.<br /></li>
<li><a id="org3c3aa24"></a>org roam<br />
<ul class="org-ul">
<li><a id="org3c2444f"></a>when inside of a page, I should be able to select existing heading of the selected pages to insert as a link.<br />
<div class="outline-text-6" id="text-org3c2444f">
<p>
The user experience here is more seamless than having to navigate to the page -&gt; find the heading -&gt; copy link from the heading and come back to insert.
</p>

<p>
This faetures is waiting on implementation on <a href="#org37884ed">PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)</a>
</p>
</div>
</li>
<li><a id="org88e1cc6"></a>for any heading that have a link attach to it, id should be automatically generated so that that this block now will be treated as a "node" which have a set of faetures available to it.<br />
<div class="outline-text-6" id="text-org88e1cc6">
<p>
example of feature that can be useful are "synchonized name change" (name of the reference node change when the original node name is change.)
</p>
</div>
</li>
</ul>
</li>
<li><a id="orgb53fb14"></a>PROJECT implement tagging system. currently, I used other people default setup and it doesn't fit my needs.<br /></li>
<li><a id="org9db32ea"></a>typing ']]' will close code block that doesn't yet been close. This is behavior is similar to latex in vim that I have set up. (This enhances flexibility of use case)<br /></li>
<li><a id="orgee11328"></a>PROJECT literate programming in emacs<br />
<div class="outline-text-5" id="text-orgee11328">
<p>
ref:
</p>
<ul class="org-ul">
<li><a href="https://jamiecollinson.com/blog/my-emacs-config/">https://jamiecollinson.com/blog/my-emacs-config/</a></li>
<li><a href="https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org">https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org</a></li>
</ul>

<p>
note:
this can be used when writing report for data science project as well <a href="https://www.youtube.com/watch?v=dljNabciEGg&amp;ab_channel=HowardAbrams">literate devops</a>.
</p>
</div>
<ul class="org-ul">
<li><a id="orge0dfa00"></a>allow header property <code>:dir:</code> to be set as a starting point of directory in which code will be operate on.<br /></li>
</ul>
</li>
<li><a id="org76a0f23"></a>PROJECT allow cmd command (defined in .zshrc) to be used in org-babel code block<br />
<ul class="org-ul">
<li><a id="org52b2944"></a>error<br />
<div class="outline-text-6" id="text-org52b2944">
<p>
I am not sure what is going on but when I run the block with bash/zsh/sh <code>cmd</code> command is not found
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org952bca9" class="outline-4">
<h4 id="org952bca9">user experience</h4>
<div class="outline-text-4" id="text-org952bca9">
<p>
ref:
</p>
<ul class="org-ul">
<li><a href="https://hungyi.net/posts/doom-emacs-search-replace-project/#fn.1">https://hungyi.net/posts/doom-emacs-search-replace-project/#fn.1</a></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgc7d865e"></a>enlarge window to occupy the whole space and reset window to default (which occupied space equally)<br />
<div class="outline-text-5" id="text-orgc7d865e">
<p>
I accidentally deleted enlarg-window-maximize, so I have to reimplement it
</p>
<div class="org-src-container">
<pre class="src src-elisp">(global-set-key (kbd "C-x !") 'enlarge-window-maximize)
</pre>
</div>
</div>
</li>

<li><a id="orgaed67a2"></a>increase/decrease text size such that all other buffer text size will be adjusted at the same time. (not limited to opened buffer; all future buffer should also obey condition)<br />
<div class="outline-text-5" id="text-orgaed67a2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defadvice text-scale-increase (around all-buffers (arg) activate)
  (dolist (buffer (buffer-list))
    (with-current-buffer buffer
      ad-do-it)))
</pre>
</div>
</div>
</li>
<li><a id="org51abc60"></a>capture Gif/video of screen using emacs command line, and automatically upload to cloud.<br /></li>
<li><a id="org6b1c6ef"></a>GTD<br />
<ul class="org-ul">
<li><a id="orgd93bdf1"></a>PROJECT seamlessly managing actions-wise tasks<br />
<ul class="org-ul">
<li><a id="org05e4695"></a>add new actions to child/nighbour bullet point of the current subtree of actions (the structure is similar to one I use in vim TODOMANAGER)<br /></li>
