projects/sideprojects/garun/garun.org
****** display all trees (similar to nerd tree strcuture) of actions, so one can switch to different subtree in the "actions tree" or switching to different "action tree."
****** easily move reselect new actions from existing of subtrees
**** I want string in the notes to be data in which one can highlight section to select the data then programming-langauge/filtering/functions/command can be applied to manipulate the dataset.
I can see this become really use ful when combine with [[*PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)][PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)]]
*** search and filter experience
**** PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)
*** data science features
**** passing scripts from your favorite language, and have them all available in emacs as commands.
ref: http://ergoemacs.org/emacs/elisp_perl_wrapper.html
**** allow org-babel code block to stop before finish running. (This is because sometime I want to run something at the begining of the code for debug. Without this funcationality I cannot document the code as efficiently.)
There are 2 ways to do this.
1. set time limit which code block will automatically execute
2. send command to cancle the run. (kill process)
*** PROJECT interacting with pdf files (seamless pdf interaction experience)
**** to use pdf-isearch-occur one first need to use isearch-occur -> type in a text -> run pdf-isearch-occur to find words in pdf. (or i need to run pdf-isearch-minor-mode, but it is slow and keybinding may need to remap to match evil-mode keybinding.)
**** very buggy and unpredicable at times
*** colloborative features
**** real time coding
***** using Floobits to share code editing in real time (this allow sharing real time independent of text editor or IDE being used.)
*** emails
**** I have problem setting up mu4e with doom emacs
error is shown below
#+BEGIN_SRC markdown
IMAP command 'LOGIN <user> <pass>' returned an error: NO [AUTHENTICATIONFAILED] Invalid credentials (Failure)
#+END_SRC
*** PROJECT Intelligent-based feautures
**** GPT-3 automatially generate tags when highlighted text from Readwise are imported to my knowledge based
To do this, I need to fine tune GPT-3 to optimize for searchability and discoveribility within knowledgebased "page protocol.")
**** During creative session or writing session, Garun should allow GPT-3 to generate questions to trigger our creativity (create either bias or diversification of thought.).
*** Communicating between emacs and outside emacs
**** note
brainstorming on ways to use emacs to communicate with outside world
url: https://www.reddit.com/r/emacs/comments/5jhwlu/getting_things_from_outside_emacs_into/
*** Leetcode
ref:
Buffer leetcode-testcase and leetcode-result not displaying in corresponding window #70
https://github.com/kaiwk/leetcode.el/issues/70

**** fix Leetcode.el to always show windows without being replaced by new window. New window should be placed some where else.

**** create a leetcommand for refreshing window (in case unexpected ui behavior occurs)
*** Publish website with org-mode
*** Dealing with Images
**** improve on image-dired
***** display list of existing tags globally and locally
****** when select tags to display tagged images, ui should show window at the bottom and list of files + directory of each images and ui should allow for further filtering by matched word. (This ui idea is similar to ~+default/search-buffer~ )
This is a very interesting workflow that reduce fiction between a user's thought to output.

usecase:
imagine that when you think of "vacation." You can get all of the pictures that have vacation tags and you may filter it further by file name and dir name (e.g. "2020", "Thailand").
***** provide autocomplete mechanism when trying to mark by tags. (C-t f)
***** Allow image preview as seen in [[https://youtu.be/HzFqZ0Gl0aw?t=238][this video.]]
I believe that this behavior is done using image-dired.

list of candidate command that I think can create the desired behavior.
When inside of dired mode
~image-dired~next-line-and~display~
~image-dired~previous-line-and~display~
When inside image-dired mode (only whos thumbnail)
~image-dired-display-next-thumbnail~
~image-dired-display-previous-thumbnail~

The problem is when using these commands the following undesired behavior occurs
1. when run command, cursor position has move into newly opened buffer.
2. when run command, newly created buffer replace the original buffer.


Error:
displaying thumbnail default behavior in doom emacs are strange to use. Behavior is not as the same as the one shown in [[https://youtu.be/NrY3t3W0_cM?t=154][this video.]]
*** Bookmark
ref:
[[https://www.youtube.com/watch?v=Im8taRkzYAc][Enhance your Emacs experience with Bookmark Plus]]

~Bookmarkplus~ allows one to bookmark things beyond just file. It contains interesting ideas and workflows, but this workflow may results in very unorganized bookmark which may overtime becomes unobtainable.
If I in the future finds default ~Bookmark~ functionality to be limited, ~Bookmarkplus~ should be further explored.

*** Dired
**** select files in dired by regex.

** current features
*** org mode
**** presentation
***** org-tree-slides for live demo
****** ref
******* https://www.youtube.com/watch?v=vz9aLmxYJB0&ab_channel=SystemCrafters
****** follow along features
to show history of type keys stroke,
run =globalcommand-log-mode= follow by =clm/toggle-command-log-buffer=
****** presentation
******* presentation that required live coding.
******** tools
********* org tree slide
