projects/sideprojects/public/garun.html
<li><a id="org3706268"></a>display all trees (similar to nerd tree strcuture) of actions, so one can switch to different subtree in the "actions tree" or switching to different "action tree."<br /></li>
<li><a id="org08e1c64"></a>easily move reselect new actions from existing of subtrees<br /></li>
</ul>
</li>
</ul>
</li>
<li><a id="org230d1ff"></a>I want string in the notes to be data in which one can highlight section to select the data then programming-langauge/filtering/functions/command can be applied to manipulate the dataset.<br />
<div class="outline-text-5" id="text-org230d1ff">
<p>
I can see this become really use ful when combine with <a href="#org37884ed">PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)</a>
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org95c03bd" class="outline-4">
<h4 id="org95c03bd">search and filter experience</h4>
<div class="outline-text-4" id="text-org95c03bd">
</div>
<ul class="org-ul">
<li><a id="org37884ed"></a>PROJECT multi-layer text search filter. (design UI experience for piping sequence of regex output)<br /></li>
</ul>
</div>
<div id="outline-container-org1b1a7c8" class="outline-4">
<h4 id="org1b1a7c8">data science features</h4>
<div class="outline-text-4" id="text-org1b1a7c8">
</div>
<ul class="org-ul">
<li><a id="orgf5c2230"></a>passing scripts from your favorite language, and have them all available in emacs as commands.<br />
<div class="outline-text-5" id="text-orgf5c2230">
<p>
ref: <a href="http://ergoemacs.org/emacs/elisp_perl_wrapper.html">http://ergoemacs.org/emacs/elisp_perl_wrapper.html</a>
</p>
</div>
</li>
<li><a id="orgb9345c6"></a>allow org-babel code block to stop before finish running. (This is because sometime I want to run something at the begining of the code for debug. Without this funcationality I cannot document the code as efficiently.)<br />
<div class="outline-text-5" id="text-orgb9345c6">
<p>
There are 2 ways to do this.
</p>
<ol class="org-ol">
<li>set time limit which code block will automatically execute</li>
<li>send command to cancle the run. (kill process)</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org57ade79" class="outline-4">
<h4 id="org57ade79">PROJECT interacting with pdf files (seamless pdf interaction experience)</h4>
<div class="outline-text-4" id="text-org57ade79">
</div>
<ul class="org-ul">
<li><a id="org1be5f75"></a>to use pdf-isearch-occur one first need to use isearch-occur -&gt; type in a text -&gt; run pdf-isearch-occur to find words in pdf. (or i need to run pdf-isearch-minor-mode, but it is slow and keybinding may need to remap to match evil-mode keybinding.)<br /></li>
<li><a id="orgd15af32"></a>very buggy and unpredicable at times<br /></li>
</ul>
</div>
<div id="outline-container-org1858791" class="outline-4">
<h4 id="org1858791">colloborative features</h4>
<div class="outline-text-4" id="text-org1858791">
</div>
<ul class="org-ul">
<li><a id="org81cb863"></a>real time coding<br />
<ul class="org-ul">
<li><a id="org49d1817"></a>using Floobits to share code editing in real time (this allow sharing real time independent of text editor or IDE being used.)<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org88a2acd" class="outline-4">
<h4 id="org88a2acd">emails</h4>
<div class="outline-text-4" id="text-org88a2acd">
</div>
<ul class="org-ul">
<li><a id="org11625b6"></a>I have problem setting up mu4e with doom emacs<br />
<div class="outline-text-5" id="text-org11625b6">
<p>
error is shown below
</p>
<div class="org-src-container">
<pre class="src src-markdown">IMAP command 'LOGIN &lt;user&gt; &lt;pass&gt;' returned an error: NO [AUTHENTICATIONFAILED] Invalid credentials (Failure)
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8305bfa" class="outline-4">
<h4 id="org8305bfa">PROJECT Intelligent-based feautures</h4>
<div class="outline-text-4" id="text-org8305bfa">
</div>
<ul class="org-ul">
<li><a id="org9e6dc0e"></a>GPT-3 automatially generate tags when highlighted text from Readwise are imported to my knowledge based<br />
<div class="outline-text-5" id="text-org9e6dc0e">
<p>
To do this, I need to fine tune GPT-3 to optimize for searchability and discoveribility within knowledgebased "page protocol.")
</p>
</div>
</li>
<li><a id="org0cf5dde"></a>During creative session or writing session, Garun should allow GPT-3 to generate questions to trigger our creativity (create either bias or diversification of thought.).<br /></li>
</ul>
</div>
<div id="outline-container-orga4919cd" class="outline-4">
<h4 id="orga4919cd">Communicating between emacs and outside emacs</h4>
<div class="outline-text-4" id="text-orga4919cd">
</div>
<ul class="org-ul">
<li><a id="orge54c31c"></a>note<br />
<div class="outline-text-5" id="text-orge54c31c">
<p>
brainstorming on ways to use emacs to communicate with outside world
url: <a href="https://www.reddit.com/r/emacs/comments/5jhwlu/getting_things_from_outside_emacs_into/">https://www.reddit.com/r/emacs/comments/5jhwlu/getting_things_from_outside_emacs_into/</a>
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org0d5a460" class="outline-4">
<h4 id="org0d5a460">Leetcode</h4>
<div class="outline-text-4" id="text-org0d5a460">
<p>
ref:
Buffer leetcode-testcase and leetcode-result not displaying in corresponding window #70
<a href="https://github.com/kaiwk/leetcode.el/issues/70">https://github.com/kaiwk/leetcode.el/issues/70</a>
</p>
</div>

<ul class="org-ul">
<li><a id="org7c37c60"></a>fix Leetcode.el to always show windows without being replaced by new window. New window should be placed some where else.<br /></li>

<li><a id="org57c8a30"></a>create a leetcommand for refreshing window (in case unexpected ui behavior occurs)<br /></li>
</ul>
</div>
<div id="outline-container-orge680d21" class="outline-4">
<h4 id="orge680d21">Publish website with org-mode</h4>
</div>
<div id="outline-container-orgeb1eaf8" class="outline-4">
<h4 id="orgeb1eaf8">Dealing with Images</h4>
<div class="outline-text-4" id="text-orgeb1eaf8">
</div>
<ul class="org-ul">
<li><a id="orge89a033"></a>improve on image-dired<br />
<ul class="org-ul">
<li><a id="org3805f47"></a>display list of existing tags globally and locally<br />
<ul class="org-ul">
<li><a id="org0c56537"></a>when select tags to display tagged images, ui should show window at the bottom and list of files + directory of each images and ui should allow for further filtering by matched word. (This ui idea is similar to <code>+default/search-buffer</code> )<br />
<div class="outline-text-7" id="text-org0c56537">
<p>
This is a very interesting workflow that reduce fiction between a user's thought to output.
</p>

<p>
usecase:
imagine that when you think of "vacation." You can get all of the pictures that have vacation tags and you may filter it further by file name and dir name (e.g. "2020", "Thailand").
</p>
</div>
</li>
</ul>
</li>
<li><a id="orgea99697"></a>provide autocomplete mechanism when trying to mark by tags. (C-t f)<br /></li>
<li><a id="orga0f11b4"></a>Allow image preview as seen in <a href="https://youtu.be/HzFqZ0Gl0aw?t=238">this video.</a><br />
<div class="outline-text-6" id="text-orga0f11b4">
<p>
I believe that this behavior is done using image-dired.
</p>

<p>
list of candidate command that I think can create the desired behavior.
When inside of dired mode
<code>image-dired~next-line-and~display</code>
<code>image-dired~previous-line-and~display</code>
When inside image-dired mode (only whos thumbnail)
<code>image-dired-display-next-thumbnail</code>
<code>image-dired-display-previous-thumbnail</code>
</p>

<p>
The problem is when using these commands the following undesired behavior occurs
</p>
<ol class="org-ol">
<li>when run command, cursor position has move into newly opened buffer.</li>
<li>when run command, newly created buffer replace the original buffer.</li>
</ol>


<p>
Error:
displaying thumbnail default behavior in doom emacs are strange to use. Behavior is not as the same as the one shown in <a href="https://youtu.be/NrY3t3W0_cM?t=154">this video.</a>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgb8bb9ef" class="outline-4">
<h4 id="orgb8bb9ef">Bookmark</h4>
<div class="outline-text-4" id="text-orgb8bb9ef">
<p>
ref:
<a href="https://www.youtube.com/watch?v=Im8taRkzYAc">Enhance your Emacs experience with Bookmark Plus</a>
</p>

<p>
<code>Bookmarkplus</code> allows one to bookmark things beyond just file. It contains interesting ideas and workflows, but this workflow may results in very unorganized bookmark which may overtime becomes unobtainable.
If I in the future finds default <code>Bookmark</code> functionality to be limited, <code>Bookmarkplus</code> should be further explored.
</p>
</div>
</div>

<div id="outline-container-org668414a" class="outline-4">
<h4 id="org668414a">Dired</h4>
<div class="outline-text-4" id="text-org668414a">
</div>
<ul class="org-ul">
<li><a id="org860df0e"></a>select files in dired by regex.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org6a17cc6" class="outline-3">
<h3 id="org6a17cc6">current features</h3>
<div class="outline-text-3" id="text-org6a17cc6">
</div>
<div id="outline-container-orgde40615" class="outline-4">
<h4 id="orgde40615">org mode</h4>
<div class="outline-text-4" id="text-orgde40615">
</div>
<ul class="org-ul">
<li><a id="orga56a590"></a>presentation<br />
<ul class="org-ul">
<li><a id="org0789acf"></a>org-tree-slides for live demo<br />
<ul class="org-ul">
<li><a id="org29c63b2"></a>ref<br />
<ul class="org-ul">
<li><a id="org10fd33b"></a><a href="https://www.youtube.com/watch?v=vz9aLmxYJB0&amp;ab_channel=SystemCrafters">https://www.youtube.com/watch?v=vz9aLmxYJB0&amp;ab_channel=SystemCrafters</a><br /></li>
</ul>
</li>
<li><a id="orgd0c0e19"></a>follow along features<br />
<div class="outline-text-7" id="text-orgd0c0e19">
<p>
to show history of type keys stroke,
run <code>globalcommand-log-mode</code> follow by <code>clm/toggle-command-log-buffer</code>
</p>
</div>
</li>
<li><a id="org6e2a87e"></a>presentation<br />
<ul class="org-ul">
<li><a id="org2a5cf37"></a>presentation that required live coding.<br />
<ul class="org-ul">
