projects/sideprojects/garun/garun.org
******** initial setup
#+BEGIN_SRC emacs-lisp
(use-package org-tree-slide
  :custom
  (org-image-actual-width nil))
#+END_SRC

run = org-treeside with =C-<= and =C->=
******** simple presentation
=org-tree-slide-mode=
******** narrow presentation
toggle =org-tree-slide-narrow-control-profile= to be on
only show slides that have todos
comment slide algo get skip
******** configuration
#+BEGIN_SRC emacs-lisp
(defun efs/presentation-setup ()
  (setq text-scale-mode-amount 3)
  (org-display-inline-images)
  (text-scale-mode 1))

(defun efs/presentation-end ()
  (text-scale-mode 0))

(use-package! org-tree-slide
  :hook ((org-tree-slide-play . efs/presentation-setup)
         (org-tree-slide-stop . efs/presentation-end))
  :custom
  (org-tree-slide-slide-in-effect t)
  (org-tree-slide-activate-message "Presentation started!")
  (org-tree-slide-deactivate-message "Presenatation finished!")
  (org-tree-slide-header t)
  (org-tree-slide-breadcrumbs " // ")
  (org-image-actual-width nil))
#+END_SRC
******** sharing presentation slides
run =org-beamer-export-to-pdf=
***** use org-reveal for standard presentation
I pick =org-reveal= over =org-beamer= because I am not sure if =org-beamer= has notes features.
**** clocking
***** how much time do I take to complete task x?
first clock-in under a heading then you can choose to clock-goto to go to the heading that clock is in.
To end the clock and output the estimated time for the task, clock-out can be used.
**** Allow literate programming with org-babel where org-babel block are treated as organized as "outline nodes oragnization" styles used in leo IDE.
requirement:
    literate programming using org-babel to tangle codes in non linear ways. This idea can be expanded to utilize leo ideo ideas of "outline nodes organization" (finer than file-based organization). To do this each org-babel block must be able to references "inside" other blocks (not only as input to other block) by tagging nodes of the block. t

Demo of this feature is demonstrated by using org-babel with org block and org-roam  literater devops + nodes-outlines organization (from leo IDE).
**** allow "making literate note from source code"

*** movement
**** ace-jump
