projects/sideprojects/public/garun.html
<li><a id="org4b0ede4"></a>tools<br />
<ul class="org-ul">
<li><a id="org128cf61"></a>org tree slide<br /></li>
</ul>
</li>
<li><a id="orgfa795ba"></a>initial setup<br />
<div class="outline-text-9" id="text-orgfa795ba">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-tree-slide
  :custom
  (org-image-actual-width nil))
</pre>
</div>

<p>
run = org-treeside with <code>C-&lt;</code> and <code>C-&gt;</code>
</p>
</div>
</li>
<li><a id="org0830a89"></a>simple presentation<br />
<div class="outline-text-9" id="text-org0830a89">
<p>
<code>org-tree-slide-mode</code>
</p>
</div>
</li>
<li><a id="org1a28511"></a>narrow presentation<br />
<div class="outline-text-9" id="text-org1a28511">
<p>
toggle <code>org-tree-slide-narrow-control-profile</code> to be on
only show slides that have todos
comment slide algo get skip
</p>
</div>
</li>
<li><a id="org0b24127"></a>configuration<br />
<div class="outline-text-9" id="text-org0b24127">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun efs/presentation-setup ()
  (setq text-scale-mode-amount 3)
  (org-display-inline-images)
  (text-scale-mode 1))

(defun efs/presentation-end ()
  (text-scale-mode 0))

(use-package! org-tree-slide
  :hook ((org-tree-slide-play . efs/presentation-setup)
	 (org-tree-slide-stop . efs/presentation-end))
  :custom
  (org-tree-slide-slide-in-effect t)
  (org-tree-slide-activate-message "Presentation started!")
  (org-tree-slide-deactivate-message "Presenatation finished!")
  (org-tree-slide-header t)
  (org-tree-slide-breadcrumbs " // ")
  (org-image-actual-width nil))
</pre>
</div>
</div>
</li>
<li><a id="org7fdf018"></a>sharing presentation slides<br />
<div class="outline-text-9" id="text-org7fdf018">
<p>
run <code>org-beamer-export-to-pdf</code>
</p>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a id="org4f8c930"></a>use org-reveal for standard presentation<br />
<div class="outline-text-6" id="text-org4f8c930">
<p>
I pick <code>org-reveal</code> over <code>org-beamer</code> because I am not sure if <code>org-beamer</code> has notes features.
</p>
</div>
</li>
</ul>
</li>
<li><a id="org3d8880d"></a>clocking<br />
<ul class="org-ul">
<li><a id="orgbf47af6"></a>how much time do I take to complete task x?<br />
<div class="outline-text-6" id="text-orgbf47af6">
<p>
first clock-in under a heading then you can choose to clock-goto to go to the heading that clock is in.
To end the clock and output the estimated time for the task, clock-out can be used.
</p>
</div>
</li>
</ul>
</li>
<li><a id="org888a146"></a>Allow literate programming with org-babel where org-babel block are treated as organized as "outline nodes oragnization" styles used in leo IDE.<br />
<div class="outline-text-5" id="text-org888a146">
<p>
requirement:
    literate programming using org-babel to tangle codes in non linear ways. This idea can be expanded to utilize leo ideo ideas of "outline nodes organization" (finer than file-based organization). To do this each org-babel block must be able to references "inside" other blocks (not only as input to other block) by tagging nodes of the block. t
</p>

<p>
Demo of this feature is demonstrated by using org-babel with org block and org-roam  literater devops + nodes-outlines organization (from leo IDE).
</p>
</div>
</li>
<li><a id="org11be9f0"></a>allow "making literate note from source code"<br /></li>
</ul>
</div>

<div id="outline-container-org84b7ffe" class="outline-4">
<h4 id="org84b7ffe">movement</h4>
<div class="outline-text-4" id="text-org84b7ffe">
</div>
<ul class="org-ul">
<li><a id="org8713523"></a>ace-jump<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DESKTOP-5MMF71L</p>
<p class="date">Created: 2021-11-04 Thu 10:17</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
